//
// Copyright (c) 2006-2012, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Description:
//
//    String definitions for Boot Maintenance Utility.

//**/

/=#

#langdef   en-US "English"
#langdef   zh-Hans "Chinese"

#string STR_NULL_STRING                #language en-US  " "
#string STR_NONE                       #language en-US  "NONE"
#string STR_FORM_MAIN_TITLE            #language en-US  "Startup"
#string STR_FORM_BOOT_SETUP_TITLE      #language en-US  "Boot Options"
#string STR_FORM_BOOT_SETUP_HELP       #language en-US  "Modify system boot options"
#string STR_FORM_SET_FD_ORDER_TITLE    #language en-US  "Set Legacy Floppy Drive Order."
#string STR_FORM_SET_HD_ORDER_TITLE    #language en-US  "Set Legacy HardDisk Drive Order."
#string STR_FORM_SET_CD_ORDER_TITLE    #language en-US  "Set Legacy CD-ROM Drive Order."
#string STR_FORM_SET_NET_ORDER_TITLE   #language en-US  "Set Legacy NET Drive Order."
#string STR_FORM_SET_BEV_ORDER_TITLE   #language en-US  "Set Legacy BEV Drive Order."


#string STR_CHANGE_ORDER               #language en-US  "Change Boot Order"
#string STR_CHANGE_ORDER_HELP          #language en-US  "Change boot option's priority,Move up with "+",Move down with "-",Enter for select."
#string STR_DISABLE_LEGACY_DEVICE      #language en-US  "Disabled"

#string STR_BOOT_FORM                   #language en-US "Boot Setting"
#string STR_BOOT_FORM_HELP              #language en-US "System Boot Configuration Settings"
#string STR_BOOT_TIMEOUT                #language en-US "Setup Prompt Timeout"
#string STR_BOOT_TIMEOUT_HELP           #language en-US "Number of seconds to wait for setup activation key. 255 means indefinite waiting."
#string STR_CSM_BOOTUP_NUMLOCK          #language en-US "Bootup NumLock State"
#string STR_CSM_BOOTUP_NUMLOCK_HELP     #language en-US "Select the keyboard NumLock state."
#string STR_CSM_BOOTUP_NUMLOCK_ON       #language en-US "On"
#string STR_CSM_BOOTUP_NUMLOCK_OFF      #language en-US "Off"
#string STR_OPROM_MESSAGE               #language en-US "Option Rom Message"
#string STR_OPROM_MESSAGE_HELP          #language en-US "Enable/Disable the display of Option Rom's message."
#string STR_ENABLE_CSM                  #language en-US "CSM"
#string STR_ENABLE_CSM_HELP             #language en-US "Compatibility support Module. Permit the loading of a traditional operation system.Enable: to support Non-UEFI operation system.Disable: to support Win8 64-bit and later UEFI aware operation system."
#string STR_BOOT_MODE                   #language en-US "Boot Mode"
#string STR_BOOT_MODE_HELP              #language en-US "Select "ALL", system will try to boot to UEFI or legacy operating system.Select "UEFI Only", system will only boot to UEFI aware operating system.Select "Legacy Only", system will only boot to legacy operating system."
#string STR_ALL                         #language en-US "All"
#string STR_UEFI_ONLY                   #language en-US "UEFI Only"
#string STR_LEGACY_ONLY                 #language en-US "Legacy Only"
#string STR_BOOT_PRIORITY               #language en-US "Boot Priority"
#string STR_BOOT_PRIORITY_HELP          #language en-US "Select "UEFI First", system will try to boot to UEFI OS first and then legacy OS.Select "Legacy First", system will try to boot to legacy OS first and then UEFI OS."
#string STR_UEFI_FIRST                  #language en-US "UEFI First"
#string STR_LEGACY_FIRST                #language en-US "Legacy First"
#string STR_NORMAL                      #language en-US "Normal"
#string STR_LEGACY                      #language en-US "Legacy"

#string STR_ENABLED                     #language en-US "Enabled"
#string STR_DISABLED                    #language en-US "Disabled"
                                        
#string STR_SHELL_ENABLE                #language en-US "Internal Shell"                                       
#string STR_SHELL_ENABLE_HELP           #language en-US "Internal Shell enable/disable."               
                                        
#string STR_IPV4                        #language en-US "IPv4"
#string STR_IPV6                        #language en-US "IPv6"
#string STR_NET_BOOT_IP_VERSION         #language en-US "Net Boot IP Version"
#string STR_NET_BOOT_IP_VERSION_HELP    #language en-US "Net Boot IP Version."

#string STR_PCI_OPTION_ROM_POST         #language en-US "PCI ROM Priority"
#string STR_PCI_OPTION_ROM_POST_HELP    #language en-US "In case of multiple Option ROMs (Legacy and EFI Compatible), specifies what PCI Option rom to launch."
#string STR_AUTO         	              #language en-US "Auto"
#string STR_PCI_LEGACY                  #language en-US "Legacy ROM"
#string STR_PCI_EFI         	          #language en-US "EFI Compatible ROM"

#string STR_VIDEO_ROM_PRIORITY         	#language en-US "Video Option Rom"
#string STR_NETWORK_ROM_PRIORITY        #language en-US "Network Option Rom"
#string STR_SATA_ROM_PRIORITY         	#language en-US "Storage Option Rom"
#string STR_OTHER_ROM_PRIORITY         	#language en-US "Other PCI Option Rom"
#string STR_ROM_PRIORITY_HELP           #language en-US "Controls the execution of UEFI and Legacy Option ROM"
#string STR_LEGACY_FIRST                #language en-US "Legacy First"
#string STR_UEFI_FIRST                  #language en-US "Uefi First"
#string STR_NO_LAUNCH                   #language en-US "No Launch"

#string STR_OPROM_PRIORITY_NOTES        #language en-US "Note: Onboard SATA(AHCI) and NVME are not controlled here."

#string FORMSET_TITLE_BOOT              #language en-US "Boot"
#string FORMSET_TITLE_BOOT_HELP         #language en-US "Boot"

